In [36]:
import pandas as pd
import numpy as np

# 创建DataFrame

In [37]:
'''
   通过列表创建
'''
li = [[1,2,3,4],[5,6,7,8]]
df01 = pd.DataFrame(li)
df01

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [38]:
df01.index

RangeIndex(start=0, stop=2, step=1)

In [39]:
df01.values

array([[1, 2, 3, 4],
       [5, 6, 7, 8]])

In [40]:
'''
   通过series创建
'''
ser01 = pd.Series([1,2,3,4])
ser02 = pd.Series([1,2,3,4])
df02 = pd.DataFrame([ser01,ser02])
df02

   0  1  2  3
0  1  2  3  4
1  1  2  3  4

In [41]:
'''
   使用数组创建
'''
arr = np.random.randint(1,9,(3,3))
df02 = pd.DataFrame(arr)
df02

   0  1  2
0  2  5  4
1  3  6  7
2  1  4  5

In [42]:
'''
   字典创建
'''

dic = {
    'name':['joe','anne','yilian'],  #key就是列索引
    'age':[18,19,20],
    'class':1,  #整列数据会被标量填充
}

df03 = pd.DataFrame(dic)
df03

     name  age  class
0     joe   18      1
1    anne   19      1
2  yilian   20      1

In [43]:
'''
  重置索引
'''
df03.index = list('abc')
df03

     name  age  class
a     joe   18      1
b    anne   19      1
c  yilian   20      1

In [45]:
df03 = df03.reset_index(drop = True)   
#df03.index = list('012')
df03

     name  age  class
0     joe   18      1
1    anne   19      1
2  yilian   20      1

In [46]:
df03.columns = list('ABC')
df03

        A   B  C
0     joe  18  1
1    anne  19  1
2  yilian  20  1

# 值获取

In [47]:
'''
   列操作  查
'''
dic = {
    'name':['joe','anne','yilian'],  #key就是列索引
    'age':[18,19,20],
    'class':1,  #整列数据会被标量填充
}

df03 = pd.DataFrame(dic)
df03

     name  age  class
0     joe   18      1
1    anne   19      1
2  yilian   20      1

In [48]:
df03['name']  #返回一个series

0       joe
1      anne
2    yilian
Name: name, dtype: object

In [49]:
#获取多列数据
df03[['name','age']]  #当获取多列数据的时候回返回DataFrame

     name  age
0     joe   18
1    anne   19
2  yilian   20

In [53]:
'''
   增操作
'''
df03['address'] = ['usa','uk','china']  #添加不存在的列索引
df03

     name  age  class address
0     joe   18      1     usa
1    anne   19      1      uk
2  yilian   20      1   china

In [51]:
'''
   删
'''
df03.pop('address')  #返回被删除的内容
df03

     name  age  class
0     joe   18      1
1    anne   19      1
2  yilian   20      1

In [54]:
del(df03['address'])  #del删除
df03

     name  age  class
0     joe   18      1
1    anne   19      1
2  yilian   20      1

In [55]:
'''
   修改数据
'''
df03['class'] = [3,4,5]
df03

     name  age  class
0     joe   18      3
1    anne   19      4
2  yilian   20      5

In [56]:
'''
   行操作  查
'''
df03.loc[0]

name     joe
age       18
class      3
Name: 0, dtype: object

In [57]:
#获取多行数据
df03.loc[:]

     name  age  class
0     joe   18      3
1    anne   19      4
2  yilian   20      5

In [58]:
#选择某行某列
df03.loc[0,'name']

'joe'

In [59]:
df03.loc[[0,2],'name']

0       joe
2    yilian
Name: name, dtype: object

In [60]:
df03.loc[[0,2],['name','age']]

     name  age
0     joe   18
2  yilian   20

In [61]:
#切片
df03.loc[1:,['class','name']]

   class    name
1      4    anne
2      5  yilian

In [62]:
df03.index = ['a','b','c']
df03

     name  age  class
a     joe   18      3
b    anne   19      4
c  yilian   20      5

In [63]:
df03.iloc[0]  #可以使用数字索引获取

name     joe
age       18
class      3
Name: a, dtype: object

In [64]:
df03

     name  age  class
a     joe   18      3
b    anne   19      4
c  yilian   20      5

In [30]:
df03.iloc[[0,1],[0,1]]
df03

     name  age  class
a     joe   18      3
b    anne   19      4
c  yilian   20      5

In [31]:
'''
   增
'''
df03.loc['d'] = ['rano',16,6]   #指定一个不存在的行索引，对应上每一列数据
df03

     name  age  class
a     joe   18      3
b    anne   19      4
c  yilian   20      5
d    rano   16      6

In [32]:
'''
   删
'''
df03 = df03.drop('d')
df03

     name  age  class
a     joe   18      3
b    anne   19      4
c  yilian   20      5

In [33]:
'''
   改
'''
df03.loc['c'] = ['messi',18,7]
df03

    name  age  class
a    joe   18      3
b   anne   19      4
c  messi   18      7